app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `username` = 'gita'
 LIMIT 1
---
    public function login()
    {
        $session = session();
        $users = new UsersModel();
        $username = $this->request->getVar('username');
        $password = $this->request->getVar('password');
        $dataUser = $users->where('username' , $username)->first();