app/Controllers/Main.php

    public function detailsStocks($id_books=''){
        if(empty($id_books)){
            $this->session->setFlashdata('error_message','Unknown Data ID.') ;
            return redirect()->to('/Main/stocks');
        }
        $this->data['page_title'] = "View Stocks Details";
        $qry= $this->stocks_model->select("*")->where(['id_books'=>$id_books])->join('category', 'category.id_category = books.id_category', 'LEFT');
        $this->data['data'] = $qry->first();
---
SELECT *
FROM `books`
LEFT JOIN `category` ON `category`.`id_category` = `books`.`id_category`
WHERE `id_books` = '1'
 LIMIT 1