app/Controllers/Main.php

        public function employee(){
            $this->data['page_title'] = "Employee List";
            $this->data['list'] = $this->employee_model->orderBy('employee_code ASC')->select('*')->get()->getResult();
---
SELECT *
FROM `employee`
ORDER BY `employee_code` ASC