app/Controllers/Pos.php

    public function cashier($id_books=''){
        $this->data['request'] = $this->request;
        //autofill facture
        $date_sale = $this->request->getVar('date_sale');
        $query = $this->sale_model->select("MAX(facture) as facture")->where(["DATE_FORMAT(date_sale, '%Y-%m-%d')" => $date_sale ]);
        $result = $query->first();
        $data = $result['facture'];

        $lastQueue = substr($data, -4);
        $nextQueue = intval($lastQueue) + 1;

        //next facture
        $this->data['facture'] = 'HB' . date('dmy', $date_sale) . sprintf('%04s', $nextQueue);
        //---autofill facture kelar

        //gettable
        $facture = $this->data['facture'];
        $joinBooks= $this->detail_model->where('facture', $facture)->join('books', 'books.id_books = detail_sale.id_books')->findAll();
        $this->data['datadetail']= $joinBooks;


        //insertvaluetitle
        $qry= $this->stocks_model->select("*")->where(['id_books'=>$id_books])->join('category', 'category.id_category = books.id_category', 'LEFT');
        $this->data['data'] = $qry->first();
---
SELECT MAX(facture) as facture
FROM `sale`
WHERE DATE_FORMAT(date_sale, '%Y-%m-%d')
 LIMIT 1
SELECT *
FROM `books`
LEFT JOIN `category` ON `category`.`id_category` = `books`.`id_category`
WHERE `id_books` = ''
 LIMIT 1

        public function allSave(){
            //employeeid
            $id_employeeSes = $this->session->id_employee;
            $qryEmployee= $this->employee_model->select('*')->where(['id_employee'=>$id_employeeSes])->first();
            //employeeid end

            $facture = $this->request->getPost('facture');

            //grand_total
            $grandTotal = $this->detail_model->select("SUM(total_price) as grand_total")->where(['facture'=> $facture])->first();
            $date_sale = $this->request->getPost('date_sale');
            $time_sale = $this->request->getPost('time');
            $id_employee = $qryEmployee['id_employee'];
            $cash = $this->request->getPost('cash_payment');
            $grand_total = $grandTotal;

        //dd($facture);
            if ($cash==NULL){
               session()->setFlashdata('error_message', 'Customer Need To Pay');
                return redirect()->back()->withInput();
            }
            $insertData = [
                'facture' => $facture,
                'date_sale' => $date_sale,
                'time_sale' => $time_sale,
                'id_employee' => $id_employee,
                'cash' => $cash,
                'grand_total' => $grand_total,
                'change_purchase' => (int)$cash - (int)$grand_total['grand_total']
            ];
            $save = $this->sale_model->insert($insertData);
---
SELECT *
FROM `employee`
WHERE `id_employee` = '1'
 LIMIT 1
INSERT INTO `sale` (`facture`, `date_sale`, `time_sale`, `id_employee`, `cash`, `grand_total`, `change_purchase`) VALUES ('HB2905230018', '2023-05-29', '15:33:59', '1', '200000', ('100000'), 100000)

        public function invoice($facture=''){
            $qry= $this->sale_model->where('sale.facture', $this->session->getFlashData('data')['data'])->join('employee', 'employee.id_employee= sale.id_employee')->join('detail_sale', 'detail_sale.facture= sale.facture')->join('books', 'books.id_books= detail_sale.id_books')->findAll();
---
SELECT *
FROM `sale`
LEFT JOIN `employee` ON `employee`.`id_employee`= `sale`.`id_employee`
RIGHT JOIN `detail_sale` ON `detail_sale`.`facture`= `sale`.`facture`
RIGHT JOIN `books` ON `books`.`id_books`= `detail_sale`.`id_books`
WHERE `sale`.`facture` = 'HB2805230001'
 LIMIT 1