app/Controllers/Pos.php

SELECT *
FROM `employee`
WHERE `id_employee` = '1'
 LIMIT 1
---
    public function cashier(){
        //autofill facture
        $date_sale = $this->request->getVar('date_sale');
        $query = $this->db->query("SELECT MAX(facture) AS facture FROM sale WHERE DATE_FORMAT(date_sale, '%Y-%m-%d') = '$date_sale'");
        $result = $query->getRowArray();
        $data = $result['facture'];

        $lastQueue = substr($data, -4);
        $nextQueue = intval($lastQueue) + 1;

        //next facture
        $this->data['facture'] = 'HB' . date('dmy', $date_sale) . sprintf('%04s', $nextQueue);
        //---autofill facture kelar



        //employeeid
        $id_employee = $this->session->id_employee;
        $qry= $this->employee_model->select('*')->where(['id_employee'=>$id_employee]);
        $this->data['data'] = $qry->first();