app/Models/booksModel.php

SELECT *
FROM `category`
JOIN `books` ON `books`.`id_category` = `category`.`id_category`
SELECT *
FROM `books`
JOIN `category` ON `category`.`id_category` = `books`.`id_category`
---
function getCategory(){
    $builder = $this->db->table('books');
    $builder->join('category', 'category.id_category = books.id_category');
    $query = $builder->get();