app/Models/detailModel.php

SELECT *
FROM `detail_sale`
JOIN `books` ON `books`.`id_books` = `detail_sale`.`id_books`
---
    function getDetail(){
        $builder = $this->db->table('detail_sale');
        $builder->join('books', 'books.id_books = detail_sale.id_books');
        $query = $builder->get();