app/Models/saleModel.php

    function getAll(){
        $builder = $this->db->table('sale');
        $builder->join('detail_sale', 'detail_sale.facture = sale.facture')->join('employee', 'employee.id_employee = sale.id_employee')->join('books', 'books.id_books = detail_sale.id_books')->join('category', 'category.id_category = books.id_category');
        $query = $builder->get();
---
SELECT *
FROM `sale`
JOIN `detail_sale` ON `detail_sale`.`facture` = `sale`.`facture`
JOIN `employee` ON `employee`.`id_employee` = `sale`.`id_employee`
JOIN `books` ON `books`.`id_books` = `detail_sale`.`id_books`
JOIN `category` ON `category`.`id_category` = `books`.`id_category`